/*==========================================================================*/
/*==========================================================================*/
/*!
	@file	SceneObjReferMainMenuScratchEffect.cs
	@brief	非アクティブオブジェクト一元化クラス
	@author Developer
	@date 	2012/10/04
*/
/*==========================================================================*/
/*==========================================================================*/
/*==========================================================================*/
/*		Using																*/
/*==========================================================================*/
using UnityEngine;
using System;
using System.Collections;
using System.Collections.Generic;

/*==========================================================================*/
/*		namespace Begin 													*/
/*==========================================================================*/
/*==========================================================================*/
/*		define																*/
/*==========================================================================*/
/*==========================================================================*/
/*		macro																*/
/*==========================================================================*/
/*==========================================================================*/
/*		class																*/
/*==========================================================================*/
//----------------------------------------------------------------------------
/*!
	@brief	非アクティブオブジェクト一元化クラス
*/
//----------------------------------------------------------------------------
public class SceneObjReferMainMenuScratchEffect : SingletonComponent<SceneObjReferMainMenuScratchEffect>
{
    /*==========================================================================*/
    /*		var																	*/
    /*==========================================================================*/

    [Header("エフェクト：ガチャ用")]
    public GameObject m_EffectPrefabGachaRare1;         //!< エフェクト：ガチャ用：駒に変化：レア１
    public GameObject m_EffectPrefabGachaRare2;         //!< エフェクト：ガチャ用：駒に変化：レア２
    public GameObject m_EffectPrefabGachaRare3;         //!< エフェクト：ガチャ用：駒に変化：レア３
    public GameObject m_EffectPrefabGachaRare4;         //!< エフェクト：ガチャ用：駒に変化：レア４
    public GameObject m_EffectPrefabGachaRare5;         //!< エフェクト：ガチャ用：駒に変化：レア５
    public GameObject m_EffectPrefabGachaRare6;         //!< エフェクト：ガチャ用：駒に変化：レア６
    public GameObject m_EffectPrefabGachaToUnit;            //!< エフェクト：ガチャ用：ユニットに変化：既存ユニット
    public GameObject m_EffectPrefabGachaToUnitNew;     //!< エフェクト：ガチャ用：ユニットに変化：新規ユニット
    public GameObject m_EffectPrefabGachaAnswerToPiece; //!< エフェクト：ガチャ用：答え合わせ：ユニットに変化
    public GameObject m_EffectPrefabGachaAnswerToUnit;  //!< エフェクト：ガチャ用：答え合わせ：駒に変化

    public GameObject m_EffectPrefabFriendSelect;           //!< エフェクト：

    /*==========================================================================*/
    /*		func																*/
    /*==========================================================================*/
}
