/*==========================================================================*/
/*==========================================================================*/
/*!
	@file	LocalSaveDefine.cs
	@brief	ローカルセーブ関連定義
	@author Developer
	@date 	2012/10/04
*/
/*==========================================================================*/
/*==========================================================================*/
/*==========================================================================*/
/*		Using																*/
/*==========================================================================*/
using UnityEngine;
using System;
using System.Collections;
using System.Collections.Generic;

/*==========================================================================*/
/*		namespace Begin 													*/
/*==========================================================================*/
/*==========================================================================*/
/*		define																*/
/*==========================================================================*/
/*==========================================================================*/
/*		macro																*/
/*==========================================================================*/
/*==========================================================================*/
/*		class																*/
/*==========================================================================*/
//----------------------------------------------------------------------------
/*!
	@brief	ローカルセーブ関連定義クラス
*/
//----------------------------------------------------------------------------
static public class LocalSaveDefine
{
    public enum OptionBGM
    {
        OFF = 0,        //!< オプション設定：BGM：無効
        ON,         //!< オプション設定：BGM：有効
    }

    public enum OptionSE
    {
        OFF = 0,        //!< オプション設定：SE：無効
        ON,         //!< オプション設定：SE：有効
    }

    public enum OptionVoice
    {
        ON = 0,     //!< オプション設定：ボイス：有効(男性女性のフラグをりネームで使いまわしの為0がON)
        OFF,        //!< オプション設定：ボイス：無効
    }

    public enum OptionGuide
    {
        OFF = 0,        //!< オプション設定：ガイド表示：無し
        ON,         //!< オプション設定：ガイド表示：あり
    }

    public enum OptionSpeed
    {
        OFF = 0,        //!< オプション設定：バトル高速化：無し
        ON,         //!< オプション設定：バトル高速化：あり
    }
    public enum OptionTips
    {
        ON = 0,     //!< オプション設定：TIPS：有効
        OFF,        //!< オプション設定：TIPS：無効
    }
    public enum OptionBattleSkillTurn
    {
        OFF = 0,        //!< オプション設定：バトルスキルターン数表示：OFF
        ON,         //!< オプション設定：バトルスキルターン数表示：ON
    }
    public enum OptionBattleSkillCost
    {
        OFF = 0,        //!< オプション設定：バトルノーマルスキル発動条件表示：OFF
        ON,         //!< オプション設定：バトルノーマルスキル発動条件表示：ON
    }
    public enum OptionBattleAchieve
    {
        OFF = 0,        //!< オプション設定：バトルアチーブ表示：OFF
        ON,         //!< オプション設定：バトルアチーブ表示：ON
    }
    public enum OptionConfirmAS
    {
        ON = 0,     //!< オプション設定：ＡＳ発動確認：有り
        OFF,        //!< オプション設定：ＡＳ発動確認：無し
    }
    public enum OptionQuestEndTips
    {
        ON = 0,     //!< オプション設定：クエスト終了時TIPS表示：有り
        OFF,        //!< オプション設定：クエスト終了時TIPS表示：無し
    }
    public enum OptionAutoPlayEnable
    {
        OFF = 0,    //!< オプション設定：オートプレイ：無し
        ON,         //!< オプション設定：オートプレイ：有り
    }
    public enum OptionAutoPlayStopBoss
    {
        OFF = 0,    //!< オプション設定：オートプレイ：ボス戦到達時停止：無し
        ON,         //!< オプション設定：オートプレイ：ボス戦到達時停止：有り
    }
    public enum OptionAutoPlayUseAS
    {
        ON = 0,     //!< オプション設定：オートプレイ：ＡＳ自動使用：有り
        OFF,        //!< オプション設定：オートプレイ：ＡＳ自動使用：無し
    }
    public enum OptionNotification
    {
        ON = 0,     //!< オプション設定：プッシュ通知：有り
        OFF,        //!< オプション設定：プッシュ通知：無し
    }
    public enum OptionNotificationCasino
    {
        ON = 0,     //!< オプション設定：プッシュ通知：カジノ：有り
        OFF,        //!< オプション設定：プッシュ通知：カジノ：無し
    }
    public enum OptionNotificationEvent
    {
        ON = 0,     //!< オプション設定：プッシュ通知：イベント：有り
        OFF,        //!< オプション設定：プッシュ通知：イベント：無し
    }
    public enum OptionNotificationSeisekiden
    {
        ON = 0,     //!< オプション設定：プッシュ通知：聖石殿：有り
        OFF,        //!< オプション設定：プッシュ通知：聖石殿：無し
    }
    public enum OptionNotificationLoginBonus
    {
        ON = 0,     //!< オプション設定：プッシュ通知：ログインボーナス：有り
        OFF,        //!< オプション設定：プッシュ通知：ログインボーナス：無し
    }
    public enum OptionNotificationStaminaMax
    {
        ON = 0,     //!< オプション設定：プッシュ通知：スタミナMAX：有り
        OFF,        //!< オプション設定：プッシュ通知：スタミナMAX：無し
    }
}

/*==========================================================================*/
/*		namespace End 														*/
/*==========================================================================*/


