/*==========================================================================*/
/*==========================================================================*/
/*!
	@file	AnimationClipGettingUnit.cs
	@brief	アニメーションクリップ記憶再生クラス：リザルトでのユニット取得演出特化
	@author Developer
	@date 	2013/06/18
*/
/*==========================================================================*/
/*==========================================================================*/
/*==========================================================================*/
/*		Using																*/
/*==========================================================================*/
using UnityEngine;
using System;
using System.Collections;
using System.Collections.Generic;

/*==========================================================================*/
/*		namespace Begin 													*/
/*==========================================================================*/
/*==========================================================================*/
/*		define																*/
/*==========================================================================*/
/*==========================================================================*/
/*		macro																*/
/*==========================================================================*/
/*==========================================================================*/
/*		class																*/
/*==========================================================================*/
//----------------------------------------------------------------------------
/*!
	@brief	アニメーションクリップ記憶再生クラス：リザルトでのユニット取得演出特化
*/
//----------------------------------------------------------------------------
public class AnimationClipGettingUnit : AnimationClipPlayer
{

    //----------------------------------------------------------------------------
    /*!
		@brief	ユニット取得アニメーションID
	*/
    //----------------------------------------------------------------------------
    public enum GETTING_ANIM
    {
        PIECE_TO_CHARA_1,       //!< アニメーションラベル：キャラ化：レア度１
        PIECE_TO_CHARA_2,       //!< アニメーションラベル：キャラ化：レア度２
        PIECE_TO_CHARA_3,       //!< アニメーションラベル：キャラ化：レア度３
        PIECE_TO_CHARA_4,       //!< アニメーションラベル：キャラ化：レア度４
        PIECE_TO_CHARA_5,       //!< アニメーションラベル：キャラ化：レア度５
        PIECE_TO_CHARA_6,       //!< アニメーションラベル：キャラ化：レア度６
        MAX,                    //!< アニメーションラベル：
    };

    /*==========================================================================*/
    /*		var																	*/
    /*==========================================================================*/
    public AnimationClip m_GettingPieceToChara_1;           //!< アニメーション実体：任意選択：駒がキャラに成る時の動作：
    public AnimationClip m_GettingPieceToChara_2;           //!< アニメーション実体：任意選択：駒がキャラに成る時の動作：
    public AnimationClip m_GettingPieceToChara_3;           //!< アニメーション実体：任意選択：駒がキャラに成る時の動作：
    public AnimationClip m_GettingPieceToChara_4;           //!< アニメーション実体：任意選択：駒がキャラに成る時の動作：
    public AnimationClip m_GettingPieceToChara_5;           //!< アニメーション実体：任意選択：駒がキャラに成る時の動作：
    public AnimationClip m_GettingPieceToChara_6;           //!< アニメーション実体：任意選択：駒がキャラに成る時の動作：

    /*==========================================================================*/
    /*		func																*/
    /*==========================================================================*/
    //----------------------------------------------------------------------------
    /*!
		@brief	基底継承：AnimationClipPlayer：関連するアニメーションをAnimationクリップに追加する
		@note	Start関数で登録しようとすると、一度もアクティブ化されていないオブジェクトに再生処理を発行した際に破綻する。
				基底クラスのAwakeで呼び出すことで登録を保証する
	*/
    //----------------------------------------------------------------------------
    protected override void AnimationSetup()
    {
        //--------------------------------
        // 基底クラスの初期化実行
        //--------------------------------
        base.AnimationSetup();

        //--------------------------------
        // アニメーションコンポーネントに要素を追加登録
        //--------------------------------
        SetAnimationClipMax((int)GETTING_ANIM.MAX);
        SetAnimationClip((int)GETTING_ANIM.PIECE_TO_CHARA_1, m_GettingPieceToChara_1);
        SetAnimationClip((int)GETTING_ANIM.PIECE_TO_CHARA_2, m_GettingPieceToChara_2);
        SetAnimationClip((int)GETTING_ANIM.PIECE_TO_CHARA_3, m_GettingPieceToChara_3);
        SetAnimationClip((int)GETTING_ANIM.PIECE_TO_CHARA_4, m_GettingPieceToChara_4);
        SetAnimationClip((int)GETTING_ANIM.PIECE_TO_CHARA_5, m_GettingPieceToChara_5);
        SetAnimationClip((int)GETTING_ANIM.PIECE_TO_CHARA_6, m_GettingPieceToChara_6);
    }


    //----------------------------------------------------------------------------
    /*!
		@brief	アニメーション操作：アニメーションクリップ再生
	*/
    //----------------------------------------------------------------------------
    public bool PlayGettingAnimation(GETTING_ANIM eGettingAnim)
    {
        //--------------------------------
        // 不具合チェック
        //--------------------------------
        if (eGettingAnim < 0
        || eGettingAnim >= GETTING_ANIM.MAX
        ) return false;

        //--------------------------------
        // 再生指示
        //--------------------------------
        return PlayAnimationClip((int)eGettingAnim, true);
    }

}

