/*==========================================================================*/
/*==========================================================================*/
/*!
    @file	SceneGoesParamToMainMenu.cs
    @brief	シーン間のパラメータ受け渡しクラス：メインメニューへの受け渡し用
    @author Developer
    @date 	2013/02/08
*/
/*==========================================================================*/
/*==========================================================================*/
/*==========================================================================*/
/*		Using																*/
/*==========================================================================*/
using UnityEngine;
using System;
using System.Collections;
using System.Collections.Generic;

using ServerDataDefine;

/*==========================================================================*/
/*		namespace Begin 													*/
/*==========================================================================*/
/*==========================================================================*/
/*		define																*/
/*==========================================================================*/
/*==========================================================================*/
/*		macro																*/
/*==========================================================================*/
/*==========================================================================*/
/*		class																*/
/*==========================================================================*/
//----------------------------------------------------------------------------
/*!
    @brief	受け渡し情報：ゲームメイン→メインメニュー

    @note	ゲームリザルト情報の受け渡し用。
*/
//----------------------------------------------------------------------------
public class SceneGoesParamToMainMenu
{
    //------------------------------------------------
    // ※※※※※※※※※※※※※※※※※※※※※※
    // ローカルセーブとして文字列セーブしてJsonで構造体化する対象クラス。
    // 変数の削減によって解析エラーが発生するようになるため、扱いには注意すること。
    // ※※※※※※※※※※※※※※※※※※※※※※
    //------------------------------------------------

    public bool m_QuestEvolve;          //!< クエスト情報：進化クエストか否か
    public uint m_QuestID;              //!< クエスト情報：クエストID
    public uint m_AreaID;               //!< クエスト情報：エリアID

    public uint m_GetMoney;             //!< 取得物情報：お金
    public uint m_GetEXP;               //!< 取得物情報：経験値
    public PacketStructUnitGet[] m_GetUnit;             //!< 取得物情報：ユニット

    public PacketStructFriend m_PartyFriend;            //!< フレンド情報

    public int[] m_OpenPanel;           //!< 開いたパネル情報

    public bool m_Quest2;               //!< クエスト情報：新探索か否か

    // バトル中の実績用情報
    public AchievementTotalingInBattle.EnemyKillCountInfo[] m_EnemyKillCountList;   //!< バトル中の実績用情報：敵撃破数
    public AchievementTotalingInBattle.LimitBreakSkillUseInfo[] m_LimitBreakUseList;    //!< バトル中の実績用情報：アクティブ（リミブレ）スキル使用回数
    public bool m_NoDamagePlayer;       //!< バトル中の実績用情報：プレイヤーがノーダメージか
    public int m_MaxDamageToEnemy;     //!< バトル中の実績用情報：敵に与えた最大ダメージ
    public int m_HeroSkillUseCount;    //!< バトル中の実績用情報：ヒーロースキル使用回数

    public uint m_NextAreaCleard;

    public ServerDataDefine.PlayScoreInfo m_PlayScoreInfo;

    public bool m_IsUsedAutoPlay;   //!< オートプレイを使用したかどうか

#if SAVE_VERSIONUP_TEST
    //----------------------------------------
    //		※この定義を有効化してセーブを作成し、無効化した正規版で読み込む。
    //		※バージョンアップフラグの制御が正常動作してるなら構造体化の前にバージョン判定によるデータ破棄が走るので問題ないはず。
    //		※逆にこの定義による解析エラーが発生するのであれば、構造体の内容変化によって解析エラーが発生するフローが残っていると判断できる。
    //----------------------------------------
    public	int						m_VersionUpErrorTester	= 0;		//!< バージョンアップ時構造体変動テスト用
#endif
};

//----------------------------------------------------------------------------
/*!
    @brief	受け渡し情報：ゲームメイン→メインメニュー

    @note	ゲームリザルト情報の受け渡し用。（リタイア情報）
*/
//----------------------------------------------------------------------------
public class SceneGoesParamToMainMenuRetire
{
    //------------------------------------------------
    // ※※※※※※※※※※※※※※※※※※※※※※
    // ローカルセーブとして文字列セーブしてJsonで構造体化する対象クラス。
    // 変数の削減によって解析エラーが発生するようになるため、扱いには注意すること。
    // ※※※※※※※※※※※※※※※※※※※※※※
    //------------------------------------------------

    public uint m_QuestID;			//!< クエスト情報：クエストID
    public bool m_IsUsedAutoPlay;   //!< オートプレイを使用したかどうか
};

